Tekla.Structures.Catalogs.ShapeItem
The Shape class contains information about the shapes in the Tekla Structures shape catalog.
public class Example
{
using System;
using Tekla.Structures.Catalogs;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public void CheckAllShapes()
{
ModelObjectEnumerator moe = new Model().GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.BREP);
while (moe.MoveNext())
{
Brep myBrep = moe.Current as Brep;
if (myBrep == null) continue;
ShapeItem myShape = new ShapeItem();
myShape.Name = myBrep.Profile.ProfileString;
bool result = myShape.Select();
if (!result)
{
myShape.ShapeFacetedBrep = CreateBrepCube(1000);
myShape.Insert();
}
}
}
public FacetedBrep CreateBrepCube(double length)
{
var vertices = new[]
{
new Vector(0.0,     0.0,    0.0), // 0
new Vector(length,  0.0,    0.0), // 1
new Vector(length,  length, 0.0), // 2
new Vector(0.0,     length, 0.0), // 3
new Vector(0.0,     0.0,    length), // 4
new Vector(length,  0.0,    length), // 5
new Vector(length,  length, length), // 6
new Vector(0.0,     length, length), // 7
};
var outloop = new[] { new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
return new FacetedBrep(vertices, outloop, innerLoop);
}
}

Tekla.Structures.Catalogs.ShapeItem.MaxShapeNameLength
Maximum supported length of shape name (must match DOTCAT_SHAPE_NAME_SIZE - 1)

Tekla.Structures.Catalogs.ShapeItem.#ctor
Creates a new shape instance.

Tekla.Structures.Catalogs.ShapeItem.Name
The shape Name

Tekla.Structures.Catalogs.ShapeItem.Guid
A unique identifier of the actual shape, given initially by the ShapeCatalog. This GUID is used as the body of
the filename for the shape information found in the Shape directory

Tekla.Structures.Catalogs.ShapeItem.GeometryGuid
A unique identifier of the shape geometry, given initially by BrepStorage. This GUID is used as the body of
the filename for the shape geometry information found in the ShapeGeometries directory

Tekla.Structures.Catalogs.ShapeItem.GeometryHash
This obsolete property can still be used to store and externally provided unique hash value identifying
the shape. However, Tekla Structures does not use this value internally for anything. It is strongly
recommended to use the newer Fingerprint property for future implementations. That value is automatically
calculated by Tekla Structures for all inserted shapes and is used internally for shape identification.

Tekla.Structures.Catalogs.ShapeItem.Extrema
The extrema of the shape as an axis-aligned bounding box, as opposed to object-aligned

Tekla.Structures.Catalogs.ShapeItem.IsSolid
Set to true if the shape is detected by TS Core to be a valid solid

Tekla.Structures.Catalogs.ShapeItem.ShapeFacetedBrep
The data structure containing the geometric information of the shape as a FacetedBRep

Tekla.Structures.Catalogs.ShapeItem.UpAxis
The direction defining what is understood as "up" in the shape that the API user is providing.
Typically this is the z-axis, if the data is in global coordinates, coming from a system where Z-axis
points to global up direction.
Possible values are: Undefined = 0, X_Axis = 1, Y_Axis = 2, Z_Axis = 3.
It is highly recommendable to orient shapes in the Tekla Structures native way, that is x-axis on the extrusion line
and Y-axis pointing up.
NOTE: Specifying UpAxis to be ShapeUpAxis.Undefined may throw a ‘System.ArgumentOutOfRangeException’ exception
in certain operations, because the system can not proceed without that information.

Tekla.Structures.Catalogs.ShapeItem.Fingerprint
A fingerprint value calculated by Tekla Structures to provide quick comparison of geometries to avoid inserting
same shape multiple times to the catalog. More rigorous comparison is done only for geometries that result in
identical fingerprints.

Tekla.Structures.Catalogs.ShapeItem.BrepType
Defines BrepType of shapes.
@see enum BrepType

Tekla.Structures.Catalogs.ShapeItem.HandlePoints
Defines handle points of the shape.

Tekla.Structures.Catalogs.ShapeItem.Select(System.String)
Selects the shape based on the given name from the database.
name: The name of the shape.
Returns: True on success. False if the shape was not found.

Tekla.Structures.Catalogs.ShapeItem.Select
Selects the shape from the database based on the name given in this instance.
Returns: True on success. False if the shape was not found.

Tekla.Structures.Catalogs.ShapeItem.Delete
Deletes a shape from shape catalog based on the shape name.
Returns:
true on success.

Tekla.Structures.Catalogs.ShapeItem.Insert
Inserts a shape to the shape catalog based on the shape geometry (does not allow duplicate geometry).
Returns:
Return true on success.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void InsertSimpleCube()
{
var vertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(300.0,   0.0,   0.0), // 1
new Vector(300.0, 300.0,   0.0), // 2
new Vector(  0.0, 300.0,   0.0), // 3
new Vector(  0.0,   0.0, 300.0), // 4
new Vector(300.0,   0.0, 300.0), // 5
new Vector(300.0, 300.0, 300.0), // 6
new Vector(  0.0, 300.0, 300.0), // 7
};
var outloop = new[] { new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
var brep = new FacetedBrep(vertices, outloop, innerLoop);
var shapeItem = new ShapeItem
{
Name = "MyNiceCubeBrep",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem.Insert();
}
}

Tekla.Structures.Catalogs.ShapeItem.InsertUsingNormals
Inserts a shape to the shape catalog using the shape geometry. Uses vertex normals
to determine edge visibility. If the normal vectors of the vertices belonging to one
geometrical location are close enough, the edge will be considered smooth and will be
marked as hidden.
Returns:
Returns true on success.
using System;
using Tekla.Structures.Catalogs;
public class Example()
{
/* One edge inside the hole and one on the outer surface of the box will be hidden. */
var vertices = new[]
{
/* The main cube vertices. Notice that all vertices are triplicated, because each is
present on three different faces. Thus we get three different vertex normals for each physical
corner too. */
new Vector(   0.0,    0.0,    0.0 ), // 0
new Vector( 500.0,    0.0,    0.0 ), // 1
new Vector( 500.0,  500.0,    0.0 ), // 2
new Vector(   0.0,  500.0,    0.0 ), // 3
new Vector(   0.0,    0.0,  500.0 ), // 4
new Vector( 500.0,    0.0,  500.0 ), // 5
new Vector( 500.0,  500.0,  500.0 ), // 6
new Vector(   0.0,  500.0,  500.0 ), // 7
new Vector(   0.0,    0.0,    0.0 ), // 8
new Vector( 500.0,    0.0,    0.0 ), // 9
new Vector( 500.0,  500.0,    0.0 ), // 10
new Vector(   0.0,  500.0,    0.0 ), // 11
new Vector(   0.0,    0.0,  500.0 ), // 12
new Vector( 500.0,    0.0,  500.0 ), // 13
new Vector( 500.0,  500.0,  500.0 ), // 14
new Vector(   0.0,  500.0,  500.0 ), // 15
new Vector(   0.0,    0.0,    0.0 ), // 16
new Vector( 500.0,    0.0,    0.0 ), // 17
new Vector( 500.0,  500.0,    0.0 ), // 18
new Vector(   0.0,  500.0,    0.0 ), // 19
new Vector(   0.0,    0.0,  500.0 ), // 20
new Vector( 500.0,    0.0,  500.0 ), // 21
new Vector( 500.0,  500.0,  500.0 ), // 22
new Vector(   0.0,  500.0,  500.0 ), // 23
/* The hole corner vertices */
new Vector( 100.0,  100.0,  0.0 ), // 24
new Vector( 300.0,  100.0,  0.0 ), // 25
new Vector( 300.0,  300.0,  0.0 ), // 26
new Vector( 100.0,  300.0,  0.0 ), // 27
new Vector( 100.0,  100.0, 500.0 ), // 28
new Vector( 300.0,  100.0, 500.0 ), // 29
new Vector( 300.0,  300.0, 500.0 ), // 30
new Vector( 100.0,  300.0, 500.0 ), // 31
new Vector( 100.0,  100.0,  0.0 ), // 32
new Vector( 300.0,  100.0,  0.0 ), // 33
new Vector( 300.0,  300.0,  0.0 ), // 34
new Vector( 100.0,  300.0,  0.0 ), // 35
new Vector( 100.0,  100.0, 500.0 ), // 36
new Vector( 300.0,  100.0, 500.0 ), // 37
new Vector( 300.0,  300.0, 500.0 ), // 38
new Vector( 100.0,  300.0, 500.0 ), // 39
};
var outloop = new[]
{
new[] {  0,   3,   2,   1 },
new[] {  8,   9,  13,  12 },
new[] { 17,  18,  22,  21 },
new[] { 10,  11,  15,  14 },
new[] { 19,  16,  20,  23 },
new[] {  4,   5,   6,   7 },
new[] { 31, 28, 24, 27 },
new[] { 30, 39, 35, 26 },
new[] { 29, 38, 34, 25 },
new[] { 36, 37, 33, 32 }
};
var innerLoop = new Dictionary{int, int[][]}
{
{ 0, new[] { new[] {  24, 25, 26, 27 } } },
{ 5, new[] { new[] {  28, 31, 30, 29 } } },
};
var normals = new Vector[]
{
// Basic cube vertex normals
new Vector( 0,  0, -1 ),
new Vector( 0,  0, -1 ),
new Vector( 0,  0, -1 ),
new Vector( 0,  0, -1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0, -1 ), // CHANGE THIS TO (0, -1, 0) FOR A VISIBLE EDGE
new Vector( 0,  0, -1 ), // CHANGE THIS TO (0, -1, 0) FOR A VISIBLE EDGE
new Vector( 0,  1,  0 ),
new Vector( 0,  1,  0 ),
new Vector( 0, -1,  0 ),
new Vector( 0, -1,  0 ),
new Vector( 0,  1,  0 ),
new Vector( 0,  1,  0 ),
new Vector(-1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector(-1,  0,  0 ),
new Vector(-1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector(-1,  0,  0 ),
// Hole vertex normals
new Vector(-1,  0,  0 ), // 24
new Vector( 1,  0,  0 ), // 25
new Vector( 0,  1,  0 ), // 26
new Vector(-1,  0,  0 ), // 27
new Vector(-1,  0,  0 ), // 28
new Vector( 1,  0,  0 ), // 29
new Vector( 0,  1,  0 ), // 30
new Vector(-1,  0,  0 ), // 31
new Vector( 0, -1,  0 ), // 32
new Vector( 0, -1,  0 ), // 33
new Vector( 1,  0,  0 ), // 34
new Vector(-1,  0,  0 ), // 35 CHANGE THIS TO (0, 1, 0) FOR A VISIBLE EDGE
new Vector( 0, -1,  0 ), // 36
new Vector( 0, -1,  0 ), // 37
new Vector( 1,  0,  0 ), // 38
new Vector(-1,  0,  0 ), // 39 CHANGE THIS TO (0, 1, 0) FOR A VISIBLE EDGE
};
var brep = new FacetedBrepWithNormals(vertices, outloop, innerLoop, normals);
var shapeItem = new ShapeItem
{
Name = "CubeWithHoleTwoEdgesHidden",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
var retVal = shapeItem.InsertUsingNormals();
var brep = new Brep()
{
StartPoint = new Point(0, 8000, 0),
EndPoint = new Point(1000, 8000, 0),
Profile = { ProfileString = "CubeWithHoleTwoEdgesHidden" },
};
brep.Insert();
new Model().CommitChanges();
}

Tekla.Structures.Catalogs.ShapeItem.InsertUsingNormalsAllowDuplicates
Inserts a shape to the shape catalog using the shape geometry allowing duplicates. Uses
vertex normals to determine edge visibility. If the normal vectors of the vertices belonging
to one geometrical location are close enough, the edge will be considered smooth and will be
marked as hidden.
Returns:
Returns true on success.
using System;
using Tekla.Structures.Catalogs;
public class Example()
{
/* One edge inside the hole and one on the outer surface of the box will be hidden. */
var vertices = new[]
{
/* The main cube vertices. Notice that all vertices are triplicated, because each is
present on three different faces. Thus we get three different vertex normals for each physical
corner too. */
new Vector(   0.0,    0.0,    0.0 ), // 0
new Vector( 500.0,    0.0,    0.0 ), // 1
new Vector( 500.0,  500.0,    0.0 ), // 2
new Vector(   0.0,  500.0,    0.0 ), // 3
new Vector(   0.0,    0.0,  500.0 ), // 4
new Vector( 500.0,    0.0,  500.0 ), // 5
new Vector( 500.0,  500.0,  500.0 ), // 6
new Vector(   0.0,  500.0,  500.0 ), // 7
new Vector(   0.0,    0.0,    0.0 ), // 8
new Vector( 500.0,    0.0,    0.0 ), // 9
new Vector( 500.0,  500.0,    0.0 ), // 10
new Vector(   0.0,  500.0,    0.0 ), // 11
new Vector(   0.0,    0.0,  500.0 ), // 12
new Vector( 500.0,    0.0,  500.0 ), // 13
new Vector( 500.0,  500.0,  500.0 ), // 14
new Vector(   0.0,  500.0,  500.0 ), // 15
new Vector(   0.0,    0.0,    0.0 ), // 16
new Vector( 500.0,    0.0,    0.0 ), // 17
new Vector( 500.0,  500.0,    0.0 ), // 18
new Vector(   0.0,  500.0,    0.0 ), // 19
new Vector(   0.0,    0.0,  500.0 ), // 20
new Vector( 500.0,    0.0,  500.0 ), // 21
new Vector( 500.0,  500.0,  500.0 ), // 22
new Vector(   0.0,  500.0,  500.0 ), // 23
/* The hole corner vertices */
new Vector( 100.0,  100.0,  0.0 ), // 24
new Vector( 300.0,  100.0,  0.0 ), // 25
new Vector( 300.0,  300.0,  0.0 ), // 26
new Vector( 100.0,  300.0,  0.0 ), // 27
new Vector( 100.0,  100.0, 500.0 ), // 28
new Vector( 300.0,  100.0, 500.0 ), // 29
new Vector( 300.0,  300.0, 500.0 ), // 30
new Vector( 100.0,  300.0, 500.0 ), // 31
new Vector( 100.0,  100.0,  0.0 ), // 32
new Vector( 300.0,  100.0,  0.0 ), // 33
new Vector( 300.0,  300.0,  0.0 ), // 34
new Vector( 100.0,  300.0,  0.0 ), // 35
new Vector( 100.0,  100.0, 500.0 ), // 36
new Vector( 300.0,  100.0, 500.0 ), // 37
new Vector( 300.0,  300.0, 500.0 ), // 38
new Vector( 100.0,  300.0, 500.0 ), // 39
};
var outloop = new[]
{
new[] {  0,   3,   2,   1 },
new[] {  8,   9,  13,  12 },
new[] { 17,  18,  22,  21 },
new[] { 10,  11,  15,  14 },
new[] { 19,  16,  20,  23 },
new[] {  4,   5,   6,   7 },
new[] { 31, 28, 24, 27 },
new[] { 30, 39, 35, 26 },
new[] { 29, 38, 34, 25 },
new[] { 36, 37, 33, 32 }
};
var innerLoop = new Dictionary{int, int[][]}
{
{ 0, new[] { new[] {  24, 25, 26, 27 } } },
{ 5, new[] { new[] {  28, 31, 30, 29 } } },
};
var normals = new Vector[]
{
// Basic cube vertex normals
new Vector( 0,  0, -1 ),
new Vector( 0,  0, -1 ),
new Vector( 0,  0, -1 ),
new Vector( 0,  0, -1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0,  1 ),
new Vector( 0,  0, -1 ), // CHANGE THIS TO (0, -1, 0) FOR A VISIBLE EDGE
new Vector( 0,  0, -1 ), // CHANGE THIS TO (0, -1, 0) FOR A VISIBLE EDGE
new Vector( 0,  1,  0 ),
new Vector( 0,  1,  0 ),
new Vector( 0, -1,  0 ),
new Vector( 0, -1,  0 ),
new Vector( 0,  1,  0 ),
new Vector( 0,  1,  0 ),
new Vector(-1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector(-1,  0,  0 ),
new Vector(-1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector( 1,  0,  0 ),
new Vector(-1,  0,  0 ),
// Hole vertex normals
new Vector(-1,  0,  0 ), // 24
new Vector( 1,  0,  0 ), // 25
new Vector( 0,  1,  0 ), // 26
new Vector(-1,  0,  0 ), // 27
new Vector(-1,  0,  0 ), // 28
new Vector( 1,  0,  0 ), // 29
new Vector( 0,  1,  0 ), // 30
new Vector(-1,  0,  0 ), // 31
new Vector( 0, -1,  0 ), // 32
new Vector( 0, -1,  0 ), // 33
new Vector( 1,  0,  0 ), // 34
new Vector(-1,  0,  0 ), // 35 CHANGE THIS TO (0, 1, 0) FOR A VISIBLE EDGE
new Vector( 0, -1,  0 ), // 36
new Vector( 0, -1,  0 ), // 37
new Vector( 1,  0,  0 ), // 38
new Vector(-1,  0,  0 ), // 39 CHANGE THIS TO (0, 1, 0) FOR A VISIBLE EDGE
};
var brep = new FacetedBrepWithNormals(vertices, outloop, innerLoop, normals);
var shapeItem1 = new ShapeItem
{
Name = "CubeWithHoleTwoEdgesHidden",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
if (shapeItem1.InsertUsingNormals())
{
var brep1 = new Brep()
{
StartPoint = new Point(0, 8000, 0),
EndPoint = new Point(1000, 8000, 0),
Profile = { ProfileString = "CubeWithHoleTwoEdgesHidden" },
};
brep1.Insert();
}
var shapeItem2 = new ShapeItem
{
Name = "CubeWithHoleTwoEdgesHiddenCopy",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
if (shapeItem2.InsertUsingNormalsAllowDuplicates())
{
var brep2 = new Brep()
{
StartPoint = new Point(0, 9000, 0),
EndPoint = new Point(1000, 9000, 0),
Profile = { ProfileString = "CubeWithHoleTwoEdgesHiddenCopy" },
};
brep2.Insert();
}
new Model().CommitChanges();
}

Tekla.Structures.Catalogs.ShapeItem.Export(System.String@)
Exports the shape item in *.tsc-format to the to given file name.
If path is not given shape is exported to model folder.
If filename is empty shape name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
ShapeItem item = new ShapeItem();
string shapeName = "myShape";
if (item.Select(shapeName))
{
string filename = System.IO.Path.GetTempPath() + "\\" + shapeName;
if (item.Export(ref filename))
{
Console.WriteLine("Shape item exported successfully");
}
}
}
}
filename: The export file name of the shape item.
Returns: True on success.

Tekla.Structures.Catalogs.ShapeItem.Modify
Modifies a shape in the shape catalog based on the shape name or if not found, based on shape guid.
using Tekla.Structures.Catalogs;
public class Example
{
public void ModifyCube()
{
var insertVertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(200.5,   0.0,   0.0), // 1
new Vector(200.5, 200.5,   0.0), // 2
new Vector(  0.0, 200.5,   0.0), // 3
new Vector(  0.0,   0.0, 200.5), // 4
new Vector(200.5,   0.0, 200.5), // 5
new Vector(200.5, 200.5, 200.5), // 6
new Vector(  0.0, 200.5, 200.5), // 7
};
var outloop = new[] {
new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
var insertFBrep = new FacetedBrep(insertVertices, outloop, innerLoop);
var insertShapeItem = new ShapeItem
{
Name = "MyOtherNiceCube",
ShapeFacetedBrep = insertFBrep,
UpAxis = ShapeUpAxis.Z_Axis
};
var resultOfInsert = insertShapeItem.Insert();
insertShapeItem.Select();
var modifyVertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(400.0,   0.0,   0.0), // 1
new Vector(400.0, 400.0,   0.0), // 2
new Vector(  0.0, 400.0,   0.0), // 3
new Vector(  0.0,   0.0, 400.0), // 4
new Vector(400.0,   0.0, 400.0), // 5
new Vector(400.0, 400.0, 400.0), // 6
new Vector(  0.0, 400.0, 400.0), // 7
};
var modifyFBrep = new FacetedBrep(modifyVertices, outloop, innerLoop);
var modifyShapeItem = new ShapeItem
{
Name = "MyOtherNiceCube",
ShapeFacetedBrep = modifyFBrep,
UpAxis = ShapeUpAxis.Z_Axis
};
var resultOfModify = modifyShapeItem.Modify();
modifyShapeItem.Select();
}
}
Returns:
Return true on success.

Tekla.Structures.Catalogs.ShapeItem.CleanAndModify(System.Boolean@)
Cleans and stores the brep into the shape catalog
isSolid: Parameter indicating if is solid.
Returns: True if cleaning and storing to catalog was successful

Tekla.Structures.Catalogs.ShapeItem.Rename(System.String)
Renames a shape in the shape catalog with the given shape name.
newName: The new name.
Returns: True on success. False if the new name is empty or
duplicated as the current name, or other exceptions.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void InsertSimpleCube()
{
var vertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(300.0,   0.0,   0.0), // 1
new Vector(300.0, 300.0,   0.0), // 2
new Vector(  0.0, 300.0,   0.0), // 3
new Vector(  0.0,   0.0, 300.0), // 4
new Vector(300.0,   0.0, 300.0), // 5
new Vector(300.0, 300.0, 300.0), // 6
new Vector(  0.0, 300.0, 300.0), // 7
};
var outloop = new[] { new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
var brep = new FacetedBrep(vertices, outloop, innerLoop);
var shapeItem = new ShapeItem
{
Name = "MyNiceCubeBrep",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem.Insert
result = shapeItem.Rename("RenamedCubeBrep");
if (result)
{
result = shapeItem.Name.Equals("RenamedCubeBrep");
}
}
}

Tekla.Structures.Catalogs.ShapeItem.GetInstanceCount
Get the number of instances used in the model of a shape
This sample shows how to call the Tekla.Structures.Catalogs.ShapeItem.GetInstanceCount method to detect shapes without instances thus can be removed.
public List<string> CheckShapeInstancesTest()
{
var shapeEnumerator = CatalogHandler.GetShapeItems();
var removedShapes = new List<String>();
shapeEnumerator.Reset();
while (shapeEnumerator.MoveNext())
{
var shape = shapeEnumerator.Current;
if (shape.GetInstanceCount() == 0)
{
removedShapes.Add(shape.Name);
}
}
return removedShapes;
}
Returns:
The number of shape instances

Tekla.Structures.Catalogs.ShapeItem.SetHandlePoints(System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Set the Shape item's Handle Points
HandlePoints: The handle points.
public void SetHandlePointsTest()
{
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
var handlePoints = new List<Point>;
{
new Point(100.0, 100.0, 100.0),
new Point(-100.0, -100.0, -100.0),
};
shapeItem.SetHandlePoints(handlePoints);
}
Returns: True if success or False

Tekla.Structures.Catalogs.ShapeItem.FromStruct(Tekla.Structures.CatalogInternal.dotcatShape_t)
Copies from a struct.
shapeStruct: The shape struct.

Tekla.Structures.Catalogs.ShapeItem.ToStruct
Copies this instance to a struct.
Returns: True on success; otherwise false.

Tekla.Structures.Catalogs.ShapeItem.TryAddVectorToList(Tekla.Structures.Geometry3d.Vector,System.Collections.Generic.Dictionary{Tekla.Structures.Geometry3d.Point,System.Int32},System.Collections.Generic.List{System.Int32})
Tries to add a vector to a list.
vector: The vector to add.
vectorDict: The vector disctionary.
vectorIndexList: The vector index list.
Returns: True if successful; otherwise false.

Tekla.Structures.Catalogs.ShapeItem.Insert(System.Boolean)
Inserts a shape to the shape catalog based on the shape geometry optionally allowing duplicates.
Returns:
Return true on success.

Tekla.Structures.Catalogs.ShapeItem.SetShapeFacetedBrepUsingVertexNormals
Sets ShapeFacetedBrep using vertex normals.
Returns: True if successful; otherwise false.

Tekla.Structures.Catalogs.ShapeItem.CreateFinalBrepFromBrepWithNormals(Tekla.Structures.Geometry3d.FacetedBrepWithNormals,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Vector},System.Collections.Generic.List{System.Int32})
Add edges with visibility information to outputBrep by using vertex normal vectors provided by an input faceted B-rep.
The algorithm is explained in more detail in Confluence:
https://confluence:8443/display/TechnicalDocumentation/Using+TrimBim+for+Item+Import
or search for "Using TrimBim for Item Import"
brepIn:
The input B-rep information containing geometry of vertices, outer and inner wires and vertex normals.
comprVertices:
A list of vectors that contains the "compressed" vertex geometries. Compressed here means that geometrically same points
have been combined so that there is only one instance in the list for each unique geometry. This works in combination with
the parameter indexVertexList
///
indexVertexList:
A list that acts as a map between the original and new "compressed" index values for the vertices
Returns:
Returns a FacetedBrep that contains the edges with visibility type set by the normal vector information.